NUMERAL_NUM2CN = {
    "0": "零",
    "1": "一",
    "2": "二",
    "3": "三",
    "4": "四",
    "5": "五",
    "6": "六",
    "7": "七",
    "8": "八",
    "9": "九",
}
NUMERAL_CN2NUM = {
    "零": "0",
    "〇": "0",
    "一": "1",
    "壹": "1",
    "幺": "1",
    "二": "2",
    "贰": "2",
    "两": "2",
    "三": "3",
    "叁": "3",
    "四": "4",
    "肆": "4",
    "五": "5",
    "伍": "5",
    "六": "6",
    "陆": "6",
    "七": "7",
    "柒": "7",
    "八": "8",
    "捌": "8",
    "九": "9",
    "玖": "9",
}
UNIT_CN2NUM = {"十": 10, "拾": 10, "两": 2}
CN_ALIAS = {"本": "当前,这个,这", "内": "以内,之内", "以前": "之前"}
YEAR_ALIAS = {"今": "本", "去年": "上年", "明年": "下年"}
QUARTER_ALIAS = {"上": "上个", "下": "下个"}
MONTH_ALIAS = {"上": "上个", "下": "下个"}
WEEK_ALIAS = {"周": "星期", "上": "上个", "下": "下个"}
DAY_ALIAS = {"天": "日"}
